# category names
LABEL_NAME_DICT = {
    "save_data_profile.csv": {
        "Label_Noise": ["Normal", "Baseline instability", "Myoelectric interference", "Baseline drift"],
        "Label_rhythm": ["Normal", "Sinus bradycardia", "Sinus tachycardia", "Sinus arrhythmia",
                         "Paroxysmal supraventricular tachycardia", "Atrial flutter"],
        "Label_ST": ["Normal", "T-wave alternans", "ST-T segment changes"]
    },
    "save_data_profile_v2.csv": {
        "Label_Noise": ["正常", "机械波干扰", "肌电干扰", "基线不稳", "基线漂移", "交流电干扰"],
        "Label_rhythm": ["正常", "起搏", "右位心", "窦性停搏", "窦房结游走心律", "窦性心动过缓",
                         "窦性心动过速", "窦性心律不齐", "房性心动过速", "交界性逸搏", "阵发性室上性心动过速",
                         "心房扑动", "心房颤动", "心室颤动", "非阵发性交界性心动过速", "室性心动过速"],
        "Label_st_abnormal": ["Normal", "T-wave alternans", "ST-T segment changes",
                              "T波高尖", "PtfV1<-0.04mms", "J点抬高"]
    },
    "ruijin_ocr_processed_v1.csv": {
        "Labels": ['正常心电图', 'T波改变', 'ST-T段改变', '窦性心动过速', 'T波轻度改变', '低电压', '窦性心动过缓', 'ST段改变', 
        '心房颤动', '左心室高电压', '房性早搏', '一度房室传导阻滞', '完全性右束支传导阻滞', '窦性心律不齐', '室性早搏', 'ST段轻度改变', 
        '左前分支传导阻滞', 'ST段弓背样抬高', '不完全性右束支传导阻滞', '左心室肥厚', 'ST段压低', '起搏心电图', '完全性左束支传导阻滞', 
        '心房扑动', '房性心动过速', '异常Q波', '短阵房速', '室内传导阻滞', '顺钟向转位', 'T波高尖', 'ST-T段轻度改变', '陈旧性下壁心梗', 
        'J点抬高', '广泛性前壁心梗', '下壁心梗', '室性早搏   频发', '房性早搏   频发', '阵发性室上性心动过速', '前间壁心梗', '前壁心梗', 
        'U波明显', '预激综合征', '陈旧性前壁心梗', '室内差异性传导', '房性早搏   未下传', 'R波递增不良或逆递增', 'P波高尖', '交界性逸搏', 
        '房性早搏   连发', '短P-R正常QRS综合征', 'QT间期延长', '二度房室传导阻滞', '非阵发性交界性心动过速', '电轴左偏', '房性早搏   二联律', 
        'T波双向', '窦房结游走心律', '室性早搏   插入性', '室性早搏   连发', '三度房室传导阻滞', '交界性早搏', 'P波双峰', 'T波低平', 
        '二度一型房室传导阻滞', '后壁心梗', '右心室肥大', '室性早搏   三联律', '电轴右偏', '室性早搏   二联律', '长RR间隙', '室性逸搏', 
        '室性心动过速', 'T波倒置', 'ST段水平型压低', '二度窦房传导阻滞', '高侧壁心梗', '右心房肥大', 'ST段上斜型压低', '右位心', '心室起搏心律', 
        '房性早搏   三联律', '陈旧性后壁心梗']
    },
    "train_id_path_label.csv": {"bird_label": list(map(str, range(1, 201)))},
    "tianchi_data_profile_v1.csv": {
        "Labels": ['窦性心律', '窦性心动过缓', '窦性心动过速', 'T波改变', '正常ECG', '左心室高电压', 'ST-T改变', 
                   '电轴左偏', '电轴右偏', '右束支传导阻滞', 'ST段改变', '临界ECG', '房性早搏', 'QRS低电压', 
                   '完全性右束支传导阻滞', '窦性心律不齐', '室性早搏', '心房颤动', '异常ECG', '左心室肥大', 
                   '一度房室传导阻滞', '不完全性右束支传导阻滞', '快心室率', '非特异性T波异常', '非特异性ST段异常', 
                   '左前分支传导阻滞', '下壁异常Q波', 'QT间期延长', '逆钟向转位', '起搏心律', '非特异性ST段与T波异常', 
                   '短PR间期', '差异性传导', '顺钟向转位', '左束支传导阻滞', '早期复极化', '右心房扩大', '完全性左束支传导阻滞', 
                   '快室率心房颤动', '室内差异性传导', '前间壁R波递增不良', '室上性早搏', '复极化异常', '肺心病型', 
                   '慢心室率', '融合波', '二联律', '未下传的房性早搏', '双分支传导阻滞', '右心室肥大', '短串房性心动过速', 
                   '非特异性室内传导延迟', '非特异性室内传导阻滞', '肺型P波', '房室传导延缓']},
    "tianchi_data_profile_v2.csv": {
        "Labels": ['窦性心律', '窦性心动过缓', '窦性心动过速', 'T波改变', '左心室高电压', 'ST-T改变', '电轴左偏', '电轴右偏', 
        '右束支传导阻滞', 'ST段改变', '临界ECG', '窦性心律不齐', '房性早搏', 'QRS低电压', '心房颤动', '室性早搏', '左心室肥大', 
        '一度房室传导阻滞', '非特异性T波异常', '非特异性ST段异常', '左前分支传导阻滞', '下壁异常Q波', 'QT间期延长', '逆钟向转位', 
        '起搏心律', '短PR间期', '非特异性ST段与T波异常', '左束支传导阻滞', '差异性传导', '顺钟向转位']},
    "save_data_process_v3_5w_with_combineSTT.csv": {
        "Labels": ['左心室高电压','左心室肥厚','低电压','正常心电图','起搏心电图','窦性心律不齐','窦性心动过缓','窦性心动过速','房性心动过速','心房扑动','心房颤动','阵发性室上性心动过速','交界性逸搏','短P-R正常QRS综合征','室性早搏','一度房室传导阻滞','二度房室传导阻滞','完全性左束支传导阻滞','左前分支传导阻滞','完全性右束支传导阻滞','不完全性右束支传导阻滞','室内传导阻滞','室内差异性传导','预激综合征','T波改变','ST段改变','ST-T段改变']},



}

LABEL_NAME_DICT["save_data_profile_1212.csv"] = LABEL_NAME_DICT["save_data_profile.csv"]
